class Food {
  String name;
  String image;
  double cal;
  double time;
  double rate;
  int reviews;
  bool isLiked;
  String remark;
  String pig;
  int pigG;
  String basil;
  int basilG;
  String garlic;
  int garlicG;
  String chili;
  int chiliG;
  String sauce;
  int sauceG;

  Food({
    required this.name,
    required this.image,
    required this.cal,
    required this.time,
    required this.rate,
    required this.reviews,
    required this.isLiked,
    required this.remark,
    required this.pig,
    required this.pigG,
    required this.basil,
    required this.basilG,
    required this.garlic,
    required this.garlicG,
    required this.chili,
    required this.chiliG,
    required this.sauce,
    required this.sauceG,
  });
}

final List<Food> foods = [
  Food(
    name: "กะเพราหมูสับ",
    image: "assets/images/Screenshot 2567-11-05 at 16.32.46.png",
    cal: 120,
    time: 15,
    rate: 4.4,
    reviews: 23,
    isLiked: false,
    pig: 'เนื้อหมู',
    pigG: 400,
    basil: 'ใบกะเพรา',
    basilG: 50,
    garlic: "กระเทียม",
    garlicG: 2,
    chili: 'พริกแดงจินดา',
    chiliG: 12,
    sauce: 'น้ำปลา',
    sauceG: 1,
    remark:
        '1.หั่นหมูสันคอออกเป็นชิ้นๆ แล้วสับหมูออกให้ละเอียดตามความต้องการ แล้วพักไว้ \n2.โขลกพริกแห้งให้ละเอียด แล้วใส่พริกแดงจินดา และกระเทียมโขลกตามลงไปให้ละเอียด (สามารถปั่นแทนได้ ตามความชอบ)\n3.ตั้งกระทะให้ร้อน ใส่น้ำมันพืชลงไปพอประมาณ ผัดพริกและกระเทียมให้มีกลิ่นหอม\n4.เมื่อพริกกระเทียมหอมได้ที่แล้ว ใส่หมูสับลงไปผัดให้กระจาย ไม่เกาะกันเป็นก้อน ผัดให้เข้ากับพริกกระเทียม ให้หมูสุกในระดับนึง แล้วปรุงรสด้วย น้ำมันหอย น้ำปลา ซอสปรุงรส และซีอิ๊วดำหวาน น้ำตาล เล็กน้อย เร่งไฟผัดให้เข้ากัน ชิมรสชาติ แล้วใส่ใบกะเพราลงไปผัดให้เข้ากัน ปิดเตา ตักเสิร์ฟ',
  ),
  Food(
    name: "ห่อหมกปลาช่อน ",
    image: "assets/images/Screenshot 2567-11-05 at 16.32.40.png",
    cal: 140,
    time: 25,
    rate: 4.4,
    reviews: 23,
    isLiked: true,
    pig: 'เนื้อปลาช่อน',
    pigG: 500,
    basil: 'ใบโหระพา',
    basilG: 10,
    garlic: "ใบมะกรูด",
    garlicG: 2,
    chili: 'พริกชี้ฟ้าแดง',
    chiliG: 20,
    sauce: 'น้ำปลา',
    sauceG: 1,
    remark:
        '1.หั่นหมูสันคอออกเป็นชิ้นๆ แล้วสับหมูออกให้ละเอียดตามความต้องการ แล้วพักไว้ \n2.โขลกพริกแห้งให้ละเอียด แล้วใส่พริกแดงจินดา และกระเทียมโขลกตามลงไปให้ละเอียด (สามารถปั่นแทนได้ ตามความชอบ)\n3.ตั้งกระทะให้ร้อน ใส่น้ำมันพืชลงไปพอประมาณ ผัดพริกและกระเทียมให้มีกลิ่นหอม\n4.เมื่อพริกกระเทียมหอมได้ที่แล้ว ใส่หมูสับลงไปผัดให้กระจาย ไม่เกาะกันเป็นก้อน ผัดให้เข้ากับพริกกระเทียม ให้หมูสุกในระดับนึง แล้วปรุงรสด้วย น้ำมันหอย น้ำปลา ซอสปรุงรส และซีอิ๊วดำหวาน น้ำตาล เล็กน้อย เร่งไฟผัดให้เข้ากัน ชิมรสชาติ แล้วใส่ใบกะเพราลงไปผัดให้เข้ากัน ปิดเตา ตักเสิร์ฟ',
  ),
  Food(
    name: "ยำมะเขือย่าง ไข่ต้ม กุ้งลวก",
    image: "assets/images/Screenshot 2567-11-05 at 16.32.34.png",
    cal: 130,
    time: 18,
    rate: 4.2,
    reviews: 10,
    isLiked: false,
    pig: 'กุ้ง',
    pigG: 400,
    basil: 'ใบสะระแหน่',
    basilG: 50,
    garlic: "กระเทียม",
    garlicG: 5,
    chili: 'หอมแดง',
    chiliG: 4,
    sauce: 'น้ำปลา',
    sauceG: 3,
    remark:
        '1.หั่นหมูสันคอออกเป็นชิ้นๆ แล้วสับหมูออกให้ละเอียดตามความต้องการ แล้วพักไว้ \n2.โขลกพริกแห้งให้ละเอียด แล้วใส่พริกแดงจินดา และกระเทียมโขลกตามลงไปให้ละเอียด (สามารถปั่นแทนได้ ตามความชอบ)\n3.ตั้งกระทะให้ร้อน ใส่น้ำมันพืชลงไปพอประมาณ ผัดพริกและกระเทียมให้มีกลิ่นหอม\n4.เมื่อพริกกระเทียมหอมได้ที่แล้ว ใส่หมูสับลงไปผัดให้กระจาย ไม่เกาะกันเป็นก้อน ผัดให้เข้ากับพริกกระเทียม ให้หมูสุกในระดับนึง แล้วปรุงรสด้วย น้ำมันหอย น้ำปลา ซอสปรุงรส และซีอิ๊วดำหวาน น้ำตาล เล็กน้อย เร่งไฟผัดให้เข้ากัน ชิมรสชาติ แล้วใส่ใบกะเพราลงไปผัดให้เข้ากัน ปิดเตา ตักเสิร์ฟ',
  ),
  Food(
    name: "หอยลายผัดน้ำพริกเผา",
    image: "assets/images/Screenshot 2567-11-05 at 16.32.13.png",
    cal: 110,
    time: 16,
    rate: 4.6,
    reviews: 90,
    isLiked: true,
    pig: 'หอยลาย',
    pigG: 1000,
    basil: 'ใบโหระพา',
    basilG: 50,
    garlic: "กระเทียมสับหยาบ",
    garlicG: 2,
    chili: 'พริกขี้หนู',
    chiliG: 12,
    sauce: 'น้ำปลา',
    sauceG: 1,
    remark:
        '1.หั่นหมูสันคอออกเป็นชิ้นๆ แล้วสับหมูออกให้ละเอียดตามความต้องการ แล้วพักไว้ \n2.โขลกพริกแห้งให้ละเอียด แล้วใส่พริกแดงจินดา และกระเทียมโขลกตามลงไปให้ละเอียด (สามารถปั่นแทนได้ ตามความชอบ)\n3.ตั้งกระทะให้ร้อน ใส่น้ำมันพืชลงไปพอประมาณ ผัดพริกและกระเทียมให้มีกลิ่นหอม\n4.เมื่อพริกกระเทียมหอมได้ที่แล้ว ใส่หมูสับลงไปผัดให้กระจาย ไม่เกาะกันเป็นก้อน ผัดให้เข้ากับพริกกระเทียม ให้หมูสุกในระดับนึง แล้วปรุงรสด้วย น้ำมันหอย น้ำปลา ซอสปรุงรส และซีอิ๊วดำหวาน น้ำตาล เล็กน้อย เร่งไฟผัดให้เข้ากัน ชิมรสชาติ แล้วใส่ใบกะเพราลงไปผัดให้เข้ากัน ปิดเตา ตักเสิร์ฟ',
  ),
  Food(
    name: "ปูผัดผงกะหรี่",
    image: "assets/images/Screenshot 2567-11-05 at 16.32.04.png",
    cal: 150,
    time: 30,
    rate: 4.0,
    reviews: 76,
    isLiked: false,
    pig: 'ปูม้าสด ',
    pigG: 1000,
    basil: 'ใบกะเพรา',
    basilG: 50,
    garlic: "กระเทียม",
    garlicG: 2,
    chili: 'พริกแดงจินดา',
    chiliG: 15,
    sauce: 'นมข้นจืด',
    sauceG: 2,
    remark:
        '1.หั่นหมูสันคอออกเป็นชิ้นๆ แล้วสับหมูออกให้ละเอียดตามความต้องการ แล้วพักไว้ \n2.โขลกพริกแห้งให้ละเอียด แล้วใส่พริกแดงจินดา และกระเทียมโขลกตามลงไปให้ละเอียด (สามารถปั่นแทนได้ ตามความชอบ)\n3.ตั้งกระทะให้ร้อน ใส่น้ำมันพืชลงไปพอประมาณ ผัดพริกและกระเทียมให้มีกลิ่นหอม\n4.เมื่อพริกกระเทียมหอมได้ที่แล้ว ใส่หมูสับลงไปผัดให้กระจาย ไม่เกาะกันเป็นก้อน ผัดให้เข้ากับพริกกระเทียม ให้หมูสุกในระดับนึง แล้วปรุงรสด้วย น้ำมันหอย น้ำปลา ซอสปรุงรส และซีอิ๊วดำหวาน น้ำตาล เล็กน้อย เร่งไฟผัดให้เข้ากัน ชิมรสชาติ แล้วใส่ใบกะเพราลงไปผัดให้เข้ากัน ปิดเตา ตักเสิร์ฟ',
  ),
  Food(
    name: "พะแนงไก่",
    image: "assets/images/Screenshot 2567-11-05 at 16.31.54.png",
    cal: 140,
    time: 25,
    rate: 4.4,
    reviews: 23,
    isLiked: false,
    pig: 'เนื้อไก่  ',
    pigG: 400,
    basil: 'มะเขือพวง ',
    basilG: 100,
    garlic: "พริกแกง",
    garlicG: 150,
    chili: 'ใบมะกรูดซอย',
    chiliG: 12,
    sauce: 'น้ำตาลปี๊บ',
    sauceG: 1,
    remark:
        '1.หั่นหมูสันคอออกเป็นชิ้นๆ แล้วสับหมูออกให้ละเอียดตามความต้องการ แล้วพักไว้ \n2.โขลกพริกแห้งให้ละเอียด แล้วใส่พริกแดงจินดา และกระเทียมโขลกตามลงไปให้ละเอียด (สามารถปั่นแทนได้ ตามความชอบ)\n3.ตั้งกระทะให้ร้อน ใส่น้ำมันพืชลงไปพอประมาณ ผัดพริกและกระเทียมให้มีกลิ่นหอม\n4.เมื่อพริกกระเทียมหอมได้ที่แล้ว ใส่หมูสับลงไปผัดให้กระจาย ไม่เกาะกันเป็นก้อน ผัดให้เข้ากับพริกกระเทียม ให้หมูสุกในระดับนึง แล้วปรุงรสด้วย น้ำมันหอย น้ำปลา ซอสปรุงรส และซีอิ๊วดำหวาน น้ำตาล เล็กน้อย เร่งไฟผัดให้เข้ากัน ชิมรสชาติ แล้วใส่ใบกะเพราลงไปผัดให้เข้ากัน ปิดเตา ตักเสิร์ฟ',
  ),
];
